# Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные. 

a = 1
print(type(a))

a = 1.1
print(type(a))

a = 'в'
print(type(a))

a = 'dd'
print(type(a))

a = [2,3,4,5]
print(type(a))

a = True
print(type(a))

a = {'d','q','h','n'}
print(type(a))